# Homebrew Bundle file for DataSenderApp development dependencies

# Taps
tap "homebrew/bundle"
tap "homebrew/cask"

# Build Tools
brew "xcodegen"
brew "xcbeautify"
brew "mint"

# Code Quality
brew "swiftlint"
brew "swiftformat"
brew "sourcery"

# Testing
brew "xcov"
brew "slather"

# Networking
brew "charles"
brew "httpie"

# Documentation
brew "jazzy"
brew "markdown"

# Version Control
brew "git"
brew "git-lfs"
brew "gh"

# Security
brew "gnupg"
brew "pinentry-mac"

# Utilities
brew "jq"
brew "yq"
brew "tree"
brew "ripgrep"
brew "fd"
brew "bat"

# Node (for MCP servers)
brew "node"
brew "npm"

# Ruby (for Fastlane)
brew "rbenv"
brew "ruby-build"

# Casks (GUI Applications)
cask "sf-symbols"
cask "proxyman"
cask "xcodes"